In [1]:
# Import modules
from bs4 import BeautifulSoup
import requests
from splinter import Browser
from selenium import webdriver
import pandas as pd
import time
from secret import username, password
from sqlalchemy import create_engine
import csv
import numpy as np
import html5lib

### Mac (Irina) Connection

In [2]:
# https://splinter.readthedocs.io/en/latest/drivers/chrome.html
!which chromedriver

/usr/local/bin/chromedriver

In [3]:
# executable_path = {'executable_path': '/usr/local/bin/chromedriver'}
# browser = Browser('chrome', **executable_path, headless=False)

### Windows (Clay) Connection

In [503]:
executable_path = {'executable_path': 'C:/Users/Clay/chromedriver.exe'}
browser = Browser('chrome', **executable_path, headless=False)

### Dataset 1 - Web Scrape Box Office Mojo

In [4]:
mojo_list = []
base_url = 'https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW'
page_num = 0
table_mojo_test_df = []

for i in range(0, 10000, 200):
    if page_num < 100:
        print("Printing first 200 rows.")
        url=(f"{base_url}")
        print(url)
##         Mac (Irina)
#         executable_path = {'executable_path': '/usr/local/bin/chromedriver'}
##         Windows (Clay)
        executable_path = {'executable_path': 'C:/Users/Clay/chromedriver.exe'}
        browser = Browser('chrome', **executable_path, headless=False)
        browser.visit(url)
        time.sleep(3)
        print("Open web browser")
        tables = pd.read_html(url)
        time.sleep(3)
        table_mojo_df = tables[0] # Create table from the first page
        print("Read and save table")
        browser.quit()
        page_num += 200
        table_mojo_test_df = table_mojo_df
        print('-------------------------------------')
    else:
        print(f"Printing pages {i+1} to {i+200}")
        url=(f"{base_url}&offset={str(i)}")
        print(url)
##         Mac (Irina)
#         executable_path = {'executable_path': '/usr/local/bin/chromedriver'}
##         Windows (Clay)
        executable_path = {'executable_path': 'C:/Users/Clay/chromedriver.exe'}
        browser = Browser('chrome', **executable_path, headless=False)
        browser.visit(url)
        time.sleep(3)
        print("Open web browser")
        tables = pd.read_html(url)
        time.sleep(3)
        table_temp = tables[0]
        print("Read and save table")
        browser.quit()
        page_num += 200
        table_mojo_test_df = table_mojo_test_df.append(table_temp)
        print('-------------------------------------')

Printing first 200 rows.
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW
Open web browser
Read and save table
-------------------------------------
Printing pages 201 to 400
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=200
Open web browser
Read and save table
-------------------------------------
Printing pages 401 to 600
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=400
Open web browser
Read and save table
-------------------------------------
Printing pages 601 to 800
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=600
Open web browser
Read and save table
-------------------------------------
Printing pages 801 to 1000
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=800
Open web browser
Read and save table
-------------------------------------
Printing pages 1001 to 1200
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=1000
Open web browser
Read and save table
-------------------------------------
Printing pages 1201 to 1400
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=1200
Open web browser
Read and save table
-------------------------------------
Printing pages 1401 to 1600
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=1400
Open web browser
Read and save table
-------------------------------------
Printing pages 1601 to 1800
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=1600
Open web browser
Read and save table
-------------------------------------
Printing pages 1801 to 2000
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=1800
Open web browser
Read and save table
-------------------------------------
Printing pages 2001 to 2200
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=2000
Open web browser
Read and save table
-------------------------------------
Printing pages 2201 to 2400
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=2200
Open web browser
Read and save table
-------------------------------------
Printing pages 2401 to 2600
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=2400
Open web browser
Read and save table
-------------------------------------
Printing pages 2601 to 2800
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=2600
Open web browser
Read and save table
-------------------------------------
Printing pages 2801 to 3000
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=2800
Open web browser
Read and save table
-------------------------------------
Printing pages 3001 to 3200
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=3000
Open web browser
Read and save table
-------------------------------------
Printing pages 3201 to 3400
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=3200
Open web browser
Read and save table
-------------------------------------
Printing pages 3401 to 3600
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=3400
Open web browser
Read and save table
-------------------------------------
Printing pages 3601 to 3800
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=3600
Open web browser
Read and save table
-------------------------------------
Printing pages 3801 to 4000
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=3800
Open web browser
Read and save table
-------------------------------------
Printing pages 4001 to 4200
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=4000
Open web browser
Read and save table
-------------------------------------
Printing pages 4201 to 4400
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=4200
Open web browser
Read and save table
-------------------------------------
Printing pages 4401 to 4600
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=4400
Open web browser
Read and save table
-------------------------------------
Printing pages 4601 to 4800
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=4600
Open web browser
Read and save table
-------------------------------------
Printing pages 4801 to 5000
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=4800
Open web browser
Read and save table
-------------------------------------
Printing pages 5001 to 5200
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=5000
Open web browser
Read and save table
-------------------------------------
Printing pages 5201 to 5400
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=5200
Open web browser
Read and save table
-------------------------------------
Printing pages 5401 to 5600
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=5400
Open web browser
Read and save table
-------------------------------------
Printing pages 5601 to 5800
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=5600
Open web browser
Read and save table
-------------------------------------
Printing pages 5801 to 6000
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=5800
Open web browser
Read and save table
-------------------------------------
Printing pages 6001 to 6200
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=6000
Open web browser
Read and save table
-------------------------------------
Printing pages 6201 to 6400
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=6200
Open web browser
Read and save table
-------------------------------------
Printing pages 6401 to 6600
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=6400
Open web browser
Read and save table
-------------------------------------
Printing pages 6601 to 6800
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=6600
Open web browser
Read and save table
-------------------------------------
Printing pages 6801 to 7000
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=6800
Open web browser
Read and save table
-------------------------------------
Printing pages 7001 to 7200
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=7000
Open web browser
Read and save table
-------------------------------------
Printing pages 7201 to 7400
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=7200
Open web browser
Read and save table
-------------------------------------
Printing pages 7401 to 7600
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=7400
Open web browser
Read and save table
-------------------------------------
Printing pages 7601 to 7800
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=7600
Open web browser
Read and save table
-------------------------------------
Printing pages 7801 to 8000
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=7800
Open web browser
Read and save table
-------------------------------------
Printing pages 8001 to 8200
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=8000
Open web browser
Read and save table
-------------------------------------
Printing pages 8201 to 8400
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=8200
Open web browser
Read and save table
-------------------------------------
Printing pages 8401 to 8600
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=8400
Open web browser
Read and save table
-------------------------------------
Printing pages 8601 to 8800
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=8600
Open web browser
Read and save table
-------------------------------------
Printing pages 8801 to 9000
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=8800
Open web browser
Read and save table
-------------------------------------
Printing pages 9001 to 9200
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=9000
Open web browser

Read and save table
-------------------------------------
Printing pages 9201 to 9400
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=9200
Open web browser
Read and save table
-------------------------------------
Printing pages 9401 to 9600
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=9400
Open web browser
Read and save table
-------------------------------------
Printing pages 9601 to 9800
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=9600
Open web browser
Read and save table
-------------------------------------
Printing pages 9801 to 10000
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=9800
Open web browser
Read and save table
-------------------------------------

In [5]:
# Save to the csv file
table_mojo_test_df.to_csv("csv_files/Dataset1_Mojo_total_gross_revenue.csv")

In [6]:
table_mojo_test_df.tail(20)

,Rank,Title,Lifetime Gross,Year
180,9981,Inchon,"$5,200,986",1982
181,9982,Jane Eyre,"$5,200,601",1996
182,9983,Kelly's Heroes,"$5,200,000",1970
183,9984,Death Bell 2: Bloody Camp,"$5,198,289",2010
184,9985,L'antidote,"$5,194,913",2005
185,9986,Clara's Heart,"$5,194,491",1988
186,9987,Schuks Tshabalala's Survival Guide to South Af...,"$5,194,418",2010
187,9988,Min søsters børn i Afrika,"$5,194,312",2013
188,9989,Zindagi Na Milegi Dobara,"$5,192,743",2011
189,9990,Yoko,"$5,191,840",2012
190,9991,Nous York,"$5,189,055",2012
191,9992,Sapphire Blue,"$5,188,128",2014
192,9993,Oldboy,"$5,186,767",2013
193,9994,52 Pick-Up,"$5,186,646",1986
194,9995,Little Big Soldier,"$5,186,427",2010
195,9996,Bank Error in Your Favour,"$5,186,282",2009
196,9997,Sales gosses,"$5,184,002",2017
197,9998,Vampire Sisters 2: Bats in the Belly,"$5,182,195",2014
198,9999,Born in the Exile: Sandaime J Soul Brothers no...,"$5,181,032",2016
199,10000,All-Round Appraiser Q: The Eyes of Mona Lisa,"$5,180,116",2014

### Prepare total gross revenue data set

In [377]:
# Read the clean, combined csv file
master_df = pd.read_csv("csv_files/Dataset1_Mojo_total_gross_revenue.csv")

In [378]:
# Getting the duplicate movie by title and year released. 
duplicated_master_df = master_df.loc[master_df.duplicated(subset=["Title","Year"]), "Title"].unique()
duplicated_master_df

array(['War of the Buttons', 'My Love'], dtype=object)

In [379]:
# Get all the data for the duplicate movie 
duplicated_master_df = master_df.loc[master_df["Title"] == "War of the Buttons"]
duplicated_master_df

      Unnamed: 0  Rank               Title Lifetime Gross  Year
5984         184  5985  War of the Buttons    $15,082,409  2011
6646          46  6647  War of the Buttons    $12,326,773  2011

In [380]:
# Get all the data for the duplicate movie 
duplicated_master_df = master_df.loc[master_df["Title"] == "My Love"]
duplicated_master_df

      Unnamed: 0  Rank    Title Lifetime Gross  Year
5335         135  5336  My Love    $18,525,631  2007
8996         196  8997  My Love     $6,660,413  2007

In [381]:
# reset index
master_df.reset_index()

,index,Unnamed: 0,Rank,Title,Lifetime Gross,Year
0,0,0,1,Avengers: Endgame,"$2,797,800,564",2019
1,1,1,2,Avatar,"$2,790,439,000",2009
2,2,2,3,Titanic,"$2,195,169,138",1997
3,3,3,4,Star Wars: Episode VII - The Force Awakens,"$2,068,223,624",2015
4,4,4,5,Avengers: Infinity War,"$2,048,359,754",2018
...,...,...,...,...,...,...
9995,9995,195,9996,Bank Error in Your Favour,"$5,186,282",2009
9996,9996,196,9997,Sales gosses,"$5,184,002",2017
9997,9997,197,9998,Vampire Sisters 2: Bats in the Belly,"$5,182,195",2014
9998,9998,198,9999,Born in the Exile: Sandaime J Soul Brothers no...,"$5,181,032",2016
9999,9999,199,10000,All-Round Appraiser Q: The Eyes of Mona Lisa,"$5,180,116",2014

In [382]:
# Drop row by index. Note: this index might change in if original data changes
total_gross_info = master_df.drop(index=master_df.index[[6646, 8996]])

In [383]:
len(total_gross_info)

9998

In [384]:
# Select columns
total_gross_info = total_gross_info[['Rank', 'Title', 'Year', 'Lifetime Gross']]

In [385]:
# Rename columns
total_gross_info = total_gross_info.rename(columns={'Rank': 'rank', 'Title': 'name', 
                'Year': 'year', 'GrossNumeric': 'total_revenue_usd'})

In [386]:
# total_gross_info.set_index('rank', inplace=True)

In [387]:
total_gross_info.head()

   rank                                        name  year  Lifetime Gross
0     1                           Avengers: Endgame  2019  $2,797,800,564
1     2                                      Avatar  2009  $2,790,439,000
2     3                                     Titanic  1997  $2,195,169,138
3     4  Star Wars: Episode VII - The Force Awakens  2015  $2,068,223,624
4     5                      Avengers: Infinity War  2018  $2,048,359,754

In [388]:
# Change name column to lower case to easier join 
total_gross_info['name'] = total_gross_info['name'].str.capitalize()

In [389]:
# Drop year column
total_gross_info = total_gross_info.drop(columns='year')

In [390]:
# Rename Lifetime Gross to total_revenue_usd
total_gross_info = total_gross_info.rename(columns={'Lifetime Gross': 'total_revenue_usd'})

In [391]:
total_gross_info

,rank,name,total_revenue_usd
0,1,Avengers: endgame,"$2,797,800,564"
1,2,Avatar,"$2,790,439,000"
2,3,Titanic,"$2,195,169,138"
3,4,Star wars: episode vii - the force awakens,"$2,068,223,624"
4,5,Avengers: infinity war,"$2,048,359,754"
...,...,...,...
9995,9996,Bank error in your favour,"$5,186,282"
9996,9997,Sales gosses,"$5,184,002"
9997,9998,Vampire sisters 2: bats in the belly,"$5,182,195"
9998,9999,Born in the exile: sandaime j soul brothers no...,"$5,181,032"
9999,10000,All-round appraiser q: the eyes of mona lisa,"$5,180,116"

In [392]:
# Convert total_revenue_usd to Integer
tot_rev_usd = total_gross_info['total_revenue_usd']
len(tot_rev_usd)

9998

In [393]:
list = []
for i in tot_rev_usd:
    list.append(i.split('$')[-1]) 
print(list[:10])

['2,797,800,564', '2,790,439,000', '2,195,169,138', '2,068,223,624', '2,048,359,754', '1,670,400,637', '1,656,943,394', '1,518,812,988', '1,515,048,151', '1,450,026,933']

In [394]:
split_list = []
for i in list:
    i = i.split(',')
    split_list.append(''.join(i))

In [395]:
merged_list = []
for i in split_list:
    merged_list.append(''.join(i)) 
print(merged_list[:5])

['2797800564', '2790439000', '2195169138', '2068223624', '2048359754']

In [396]:
len(merged_list)

9998

In [397]:
# Change revenue column from string to big integer
total_gross_info['total_revenue_usd'] = merged_list

In [398]:
total_gross_info['total_revenue_usd'] = pd.to_numeric(total_gross_info['total_revenue_usd'])

In [399]:
total_gross_info.dtypes

rank                  int64
name                 object
total_revenue_usd     int64
dtype: object

In [400]:
total_gross_info.to_csv('csv_files/Total_Gross_Info.csv')

In [39]:
# Connect to the local database
connection_string = f'{username}:{password}@localhost:5432/movies_db'
engine = create_engine(f'postgresql://{connection_string}')

In [402]:
# Push total gross revenue table into the database
total_gross_info.to_sql(name='total_gross_info', con=engine, if_exists='append', index=False)

## Dataset 2 - Kaggle domestic revenue data - Load and clean¶
#### Please download source data set - https://www.kaggle.com/danielgrijalvas/movies?select=movies.csv
#### Save in 'csv_files/datasets_2745_4700_movies.csv'

In [403]:
path = 'csv_files/datasets_2745_4700_movies.csv'

In [404]:
# Convert all rows to UTF-8 type and write to a new file
with open(path, 'r', encoding='utf-8', errors='ignore') as infile, open(path + '_UTF8.csv', 'w') as outfile:
     inputs = csv.reader(infile)
     output = csv.writer(outfile)

     for index, row in enumerate(inputs):
         # Create file with no header
         if index == 0:
             continue
         output.writerow(row)

In [405]:
# Read csv file into df
domestic_df = pd.read_csv('csv_files/datasets_2745_4700_movies.csv_UTF8.csv')

In [406]:
# Add header 
domestic_df.columns = ["budget","company","country","director","genre","gross","name","rating","released","runtime","score","star","votes","writer","year"]

In [407]:
domestic_df.head(2)

,budget,company,country,director,genre,gross,name,rating,released,runtime,score,star,votes,writer,year
0,6000000,Paramount Pictures,USA,John Hughes,Comedy,70136369,Ferris Bueller's Day Off,PG-13,6/11/86,103,7.8,Matthew Broderick,264740,John Hughes,1986
1,15000000,Paramount Pictures,USA,Tony Scott,Action,179800601,Top Gun,PG,5/16/86,110,6.9,Tom Cruise,236909,Jim Cash,1986

In [408]:
# Make names capitalized
domestic_df['name'] = domestic_df['name'].str.capitalize()

In [409]:
domestic_df.head(2)

,budget,company,country,director,genre,gross,name,rating,released,runtime,score,star,votes,writer,year
0,6000000,Paramount Pictures,USA,John Hughes,Comedy,70136369,Ferris bueller's day off,PG-13,6/11/86,103,7.8,Matthew Broderick,264740,John Hughes,1986
1,15000000,Paramount Pictures,USA,Tony Scott,Action,179800601,Top gun,PG,5/16/86,110,6.9,Tom Cruise,236909,Jim Cash,1986

In [410]:
# Getting the duplicate movie by title and company released. 
duplicated_domestic_df = domestic_df.loc[domestic_df.duplicated(subset=["name","company"]), "name"].unique()
duplicated_domestic_df

array(['Bad company', 'Hairspray', 'Fantastic four'], dtype=object)

In [411]:
# Getting the duplicate movie by title and star released. 
duplicated_domestic_df = domestic_df.loc[domestic_df.duplicated(subset=["name","star"]), "name"].unique()
duplicated_domestic_df

array([], dtype=object)

In [412]:
# Getting the duplicate movie by title and country released. 
duplicated_domestic_df = domestic_df.loc[domestic_df.duplicated(subset=["name","country"]), "name"].unique()
duplicated_domestic_df

array(['Dream lover', "Nobody's fool", 'Heat', 'It takes two',
       'Rumpelstiltskin', 'Bulletproof', 'Gladiator',
       'Where the heart is', 'Hamlet', 'The in crowd',
       'Behind enemy lines', 'Out cold', 'Bad company', 'Crossroads',
       'The rookie', 'The hunted', 'It runs in the family',
       'Man of the house', 'The guardian', 'Pulse', 'Hairspray',
       'The hitcher', 'Twilight', 'The unborn', 'Fair game',
       'Death at a funeral', 'Morning glory', 'Trespass', 'The avengers',
       'Les misrables', 'Project x', 'Playing for keeps', 'Promised land',
       'Frozen', 'Hercules', 'Godzilla', 'Robocop',
       'Teenage mutant ninja turtles', 'The gift', 'Fantastic four',
       'No escape', 'Hot pursuit', 'Sing', 'Passengers', 'Masterminds'],
      dtype=object)

In [413]:
# Check duplicated movie
duplicated_domestic_df = domestic_df.loc[domestic_df["name"] == "Godzilla"]
duplicated_domestic_df

,budget,company,country,director,genre,gross,name,rating,released,runtime,score,star,votes,writer,year
2683,130000000,Centropolis Film Productions,USA,Roland Emmerich,Action,136314294,Godzilla,PG-13,5/20/98,139,5.3,Matthew Broderick,160038,Dean Devlin,1998
6207,160000000,Warner Bros.,USA,Gareth Edwards,Action,200676069,Godzilla,PG-13,5/16/14,123,6.4,Aaron Taylor-Johnson,323734,Max Borenstein,2014

In [414]:
# Rename gross to domestic_revenue_usd
domestic_gross_info = domestic_df.rename(columns={'gross': 'domestic_revenue_usd'})

In [415]:
# Rename released to release_date
domestic_gross_info = domestic_gross_info.rename(columns={'released': 'release_date','name': 'name_domestic'})

In [416]:
# Drop columns we do not need ('budget', 'runtime', 'score', 'votes', 'year')
domestic_gross_info = domestic_gross_info.drop(columns=['budget', 'runtime', 'score', 'votes', 'year'])

In [417]:
domestic_gross_info.head(2)

,company,country,director,genre,domestic_revenue_usd,name_domestic,rating,release_date,star,writer
0,Paramount Pictures,USA,John Hughes,Comedy,70136369,Ferris bueller's day off,PG-13,6/11/86,Matthew Broderick,John Hughes
1,Paramount Pictures,USA,Tony Scott,Action,179800601,Top gun,PG,5/16/86,Tom Cruise,Jim Cash

In [418]:
domestic_gross_info.dtypes

company                 object
country                 object
director                object
genre                   object
domestic_revenue_usd     int64
name_domestic           object
rating                  object
release_date            object
star                    object
writer                  object
dtype: object

In [419]:
# Change release_date to datetime type
domestic_gross_info['release_date'] = pd.to_datetime(domestic_gross_info['release_date'])

In [420]:
domestic_gross_info.dtypes

company                         object
country                         object
director                        object
genre                           object
domestic_revenue_usd             int64
name_domestic                   object
rating                          object
release_date            datetime64[ns]
star                            object
writer                          object
dtype: object

In [421]:
# Write to csv file
domestic_gross_info.to_csv('csv_files/Domestic_Gross_Info.csv')

In [422]:
# TO THIS POINT, WE HAVE CREATED TWO MASTER DATAFRAMES THAT ARE CLEAN:
# (1) Total_Gross_Info.csv
# (2) Domestic_Gross_Info.csv

#### Use pandas to push data into database

In [423]:
# Check existing tables
engine.table_names()

['total_gross_info']

In [424]:
# Create domesic gross revenue table in the database
domestic_gross_info.to_sql(name='domestic_gross_info', con=engine, if_exists='append', index=False)

In [425]:
engine.table_names()

['total_gross_info', 'domestic_gross_info']

#### Confirm data has been added by querying the international table

In [426]:
pd.read_sql_query("select * from total_gross_info", con=engine).head(2)

   rank               name  total_revenue_usd
0     1  Avengers: endgame         2797800564
1     2             Avatar         2790439000

In [427]:
pd.read_sql_query('select * from domestic_gross_info', con=engine).head(2)

,company,country,director,genre,domestic_revenue_usd,name_domestic,rating,release_date,star,writer
0,Paramount Pictures,USA,John Hughes,Comedy,70136369,Ferris bueller's day off,PG-13,1986-06-11,Matthew Broderick,John Hughes
1,Paramount Pictures,USA,Tony Scott,Action,179800601,Top gun,PG,1986-05-16,Tom Cruise,Jim Cash

### Extract Movie Rating data into a separate table

In [428]:
# Save rating into a separate table
movie_rating = domestic_gross_info[['name_domestic','rating']]

In [429]:
movie_rating.head(2)

              name_domestic rating
0  Ferris bueller's day off  PG-13
1                   Top gun     PG

In [430]:
# Push rating table to sql
movie_rating.to_sql(name='movie_rating', con=engine, if_exists='append', index=False)

In [431]:
# Check if written successfully
pd.read_sql_query('select * from movie_rating', con=engine).head()

              name_domestic rating
0  Ferris bueller's day off  PG-13
1                   Top gun     PG
2                    Aliens      R
3   Flight of the navigator     PG
4                   Platoon      R

In [432]:
# Check the size
pd.read_sql_query('select count(*) from movie_rating', con=engine).head()

   count
0   6819

In [433]:
# Check all tables in the database
engine.table_names()

['total_gross_info', 'domestic_gross_info', 'movie_rating']

### Extract Country data into a separate table

In [434]:
# Save Country data into a separate table
country = domestic_gross_info[['name_domestic','country']]

In [435]:
# Push rating table to sql
country.to_sql(name='country', con=engine, if_exists='append', index=False)

In [436]:
# Check if written successfully
pd.read_sql_query('select * from country', con=engine).head()

              name_domestic country
0  Ferris bueller's day off     USA
1                   Top gun     USA
2                    Aliens     USA
3   Flight of the navigator     USA
4                   Platoon      UK

In [437]:
# Check the size
pd.read_sql_query('select count(*) from country', con=engine).head()

   count
0   6819

In [438]:
# Check all tables in the database
engine.table_names()

['total_gross_info', 'domestic_gross_info', 'movie_rating', 'country']

### Extract Star Actor data into a separate table

In [439]:
# Save star_actor data into a separate table
star_actor = domestic_gross_info[['name_domestic','star']]

In [440]:
# Push rating table to sql
star_actor.to_sql(name='star_actor', con=engine, if_exists='append', index=False)

In [441]:
# Check if written successfully
pd.read_sql_query('select * from star_actor', con=engine).head(2)

              name_domestic               star
0  Ferris bueller's day off  Matthew Broderick
1                   Top gun         Tom Cruise

In [442]:
# Check if written successfully
pd.read_sql_query('select count(*) from star_actor', con=engine).head(2)

   count
0   6819

In [443]:
# Check all tables in the database
engine.table_names()

['total_gross_info',
 'domestic_gross_info',
 'movie_rating',
 'country',
 'star_actor']

### Extract Company data into a separate table

In [444]:
# Save company data into a separate table
company = domestic_gross_info[['name_domestic','company']]

In [445]:
# Push company table to sql
company.to_sql(name='company', con=engine, if_exists='append', index=False)

In [446]:
# Check if written successfully
pd.read_sql_query('select * from company', con=engine).head()

              name_domestic                                 company
0  Ferris bueller's day off                      Paramount Pictures
1                   Top gun                      Paramount Pictures
2                    Aliens  Twentieth Century Fox Film Corporation
3   Flight of the navigator                    Walt Disney Pictures
4                   Platoon                                 Hemdale

In [447]:
# Check the size
pd.read_sql_query('select count(*) from company', con=engine).head()

   count
0   6819

In [448]:
# Check all tables in the database
engine.table_names()

['total_gross_info',
 'domestic_gross_info',
 'movie_rating',
 'country',
 'star_actor',
 'company']

### Extract Movie Genre data into a separate table

In [449]:
# Save movie genre data into a separate table
movie_genre = domestic_gross_info[['name_domestic','genre']]

In [450]:
# Push movie_genre table to sql
movie_genre.to_sql(name='movie_genre', con=engine, if_exists='append', index=False)

In [451]:
# Check if written successfully
pd.read_sql_query('select * from movie_genre', con=engine).head()

              name_domestic      genre
0  Ferris bueller's day off     Comedy
1                   Top gun     Action
2                    Aliens     Action
3   Flight of the navigator  Adventure
4                   Platoon      Drama

In [452]:
# Check if written successfully
pd.read_sql_query('select count(*) from movie_genre', con=engine).head()

   count
0   6819

In [453]:
# Check all tables in the database
engine.table_names()

['total_gross_info',
 'domestic_gross_info',
 'movie_rating',
 'country',
 'star_actor',
 'company',
 'movie_genre']

### Extract Writer data into a separate table

In [454]:
# Save Writer data into a separate table
writer = domestic_gross_info[['name_domestic','writer']]

In [455]:
# Push writer table to sql
writer.to_sql(name='writer', con=engine, if_exists='append', index=False)

In [456]:
# Check if written successfully
pd.read_sql_query('select * from writer', con=engine).head()

              name_domestic         writer
0  Ferris bueller's day off    John Hughes
1                   Top gun       Jim Cash
2                    Aliens  James Cameron
3   Flight of the navigator  Mark H. Baker
4                   Platoon   Oliver Stone

In [457]:
# Check if written successfully
pd.read_sql_query('select count(*) from writer', con=engine).head()

   count
0   6819

In [458]:
# Check all tables in the database
engine.table_names()

['total_gross_info',
 'domestic_gross_info',
 'movie_rating',
 'country',
 'star_actor',
 'company',
 'movie_genre',
 'writer']

### Extract Director data from Domestic Gross Info table

In [459]:
# Save data into a separate table
director_movie = domestic_gross_info[['name_domestic','director']]

In [460]:
# Push the table to sql
director_movie.to_sql(name='director_movie', con=engine, if_exists='append', index=False)

In [461]:
# Check if written successfully
pd.read_sql_query('select * from director_movie', con=engine).head()

              name_domestic        director
0  Ferris bueller's day off     John Hughes
1                   Top gun      Tony Scott
2                    Aliens   James Cameron
3   Flight of the navigator  Randal Kleiser
4                   Platoon    Oliver Stone

In [462]:
# Check if written successfully
pd.read_sql_query('select count(*) from director_movie', con=engine).head()

   count
0   6819

In [463]:
# Check all tables in the database
engine.table_names()

['total_gross_info',
 'domestic_gross_info',
 'movie_rating',
 'country',
 'star_actor',
 'company',
 'movie_genre',
 'writer',
 'director_movie']

### Additional data gathering

In [4]:
# Find director of the movie
url = 'https://en.wikipedia.org/wiki/Avengers:_Endgame'

In [5]:
missing_movies_list = ['Avengers:_Endgame', 'Star_Wars:_The_Force_Awakens','Avengers:_Infinity_War',
                      'Frozen_II', 'Black_Panther_(film)', 'Star_Wars:_The_Last_Jedi', 
                      'Jurassic_World:_Fallen_Kingdom', 'Incredibles_2', 'The_Fate_of_the_Furious', 
                      'Aquaman_(film)', 'Spider-Man:_Far_From_Home', 'Captain_Marvel_(film)',
                      'Joker_(2019_film)', 'Star_Wars:_The_Rise_of_Skywalker', 'Toy_Story_4',
                      'Solo:_A_Star_Wars_Story', 'Despicable_Me_3', 'Jumanji:_Welcome_to_the_Jungle',
                      'Bohemian_Rhapsody', 'Spider-Man:_Homecoming', 'The_Secret_Life_of_Pets',
                      'Wolf_Warrior_2', 'Guardians_of_the_Galaxy_Vol._2', 'Thor:_Ragnarok',
                      'Wonder_Woman_(2017_film)', 'Coco_(2017_film)', 
                      'Jumanji:_The_Next_Level', 'Pirates_of_the_Caribbean:_Dead_Men_Tell_No_Tales',
                      'E.T._the_Extra-Terrestrial', 'Deadpool_2']

In [29]:
base_url = 'https://en.wikipedia.org/wiki/'
# missing_movies_directors = []
# missing_movies_stars = []
missing_info_dict = {'director': [], 'star': []}
temp_dir = []
temp_star = []
movie_title = ""
for i in missing_movies_list:
    print(f"Fetching info - {i}")
    url=(f"{base_url}{str(i)}")
    print(url)
    movie_title = f"{i}"
#     print(f"")
##         Mac (Irina)
    executable_path = {'executable_path': '/usr/local/bin/chromedriver'}
##         Windows (Clay)
#     executable_path = {'executable_path': 'C:/Users/Clay/chromedriver.exe'}
    browser = Browser('chrome', **executable_path, headless=False)
    browser.visit(url)
#     time.sleep(1)
    tables = pd.read_html(url)
#     time.sleep(1)
    movie_df = tables[0]
#     movie_df.to_csv(f'csv_files/{movie_title}.csv')
    director = str(movie_df.iloc[1][1])
    print(f"Director - {director}")
    star = movie_df.iloc[5][1].split()[:2]
    star = f"{star[0]} {star[1]}"
    print(f"Star - {star}")
    temp_dir.append(str(director))
    temp_star.append(str(star))
    browser.quit()
    print('-------------------------------------')

Fetching info - Avengers:_Endgame
https://en.wikipedia.org/wiki/Avengers:_Endgame
Open web browser
Director - Anthony RussoJoe Russo
Star - Robert Downey
-------------------------------------
Fetching info - Star_Wars:_The_Force_Awakens
https://en.wikipedia.org/wiki/Star_Wars:_The_Force_Awakens
Open web browser
Director - J. J. Abrams
Star - Harrison Ford
-------------------------------------
Fetching info - Avengers:_Infinity_War
https://en.wikipedia.org/wiki/Avengers:_Infinity_War
Open web browser
Director - Anthony RussoJoe Russo
Star - Robert Downey
-------------------------------------
Fetching info - Frozen_II
https://en.wikipedia.org/wiki/Frozen_II
Open web browser
Director - Chris Buck Jennifer Lee
Star - Kristen Bell
-------------------------------------
Fetching info - Black_Panther_(film)
https://en.wikipedia.org/wiki/Black_Panther_(film)
Open web browser
Director - Ryan Coogler
Star - Chadwick Boseman
-------------------------------------
Fetching info - Star_Wars:_The_Last_Jedi
https://en.wikipedia.org/wiki/Star_Wars:_The_Last_Jedi
Open web browser
Director - Rian Johnson
Star - Mark Hamill
-------------------------------------
Fetching info - Jurassic_World:_Fallen_Kingdom
https://en.wikipedia.org/wiki/Jurassic_World:_Fallen_Kingdom
Open web browser
Director - J. A. Bayona
Star - Chris Pratt
-------------------------------------
Fetching info - Incredibles_2
https://en.wikipedia.org/wiki/Incredibles_2
Open web browser
Director - Brad Bird
Star - Michael Giacchino
-------------------------------------
Fetching info - The_Fate_of_the_Furious
https://en.wikipedia.org/wiki/The_Fate_of_the_Furious
Open web browser
Director - F. Gary Gray
Star - Vin Diesel
-------------------------------------
Fetching info - Aquaman_(film)
https://en.wikipedia.org/wiki/Aquaman_(film)
Open web browser
Director - James Wan
Star - Aquamanby Mort
-------------------------------------
Fetching info - Spider-Man:_Far_From_Home
https://en.wikipedia.org/wiki/Spider-Man:_Far_From_Home
Open web browser
Director - Jon Watts
Star - Tom Holland
-------------------------------------
Fetching info - Captain_Marvel_(film)
https://en.wikipedia.org/wiki/Captain_Marvel_(film)
Open web browser
Director - Anna BodenRyan Fleck
Star - Captain Marvelby
-------------------------------------
Fetching info - Joker_(2019_film)
https://en.wikipedia.org/wiki/Joker_(2019_film)
Open web browser
Director - Todd Phillips
Star - Joaquin Phoenix
-------------------------------------
Fetching info - Star_Wars:_The_Rise_of_Skywalker
https://en.wikipedia.org/wiki/Star_Wars:_The_Rise_of_Skywalker
Open web browser
Director - J. J. Abrams
Star - Charactersby George
-------------------------------------
Fetching info - Toy_Story_4
https://en.wikipedia.org/wiki/Toy_Story_4
Open web browser
Director - Josh Cooley
Star - Tom Hanks
-------------------------------------
Fetching info - Solo:_A_Star_Wars_Story
https://en.wikipedia.org/wiki/Solo:_A_Star_Wars_Story
Open web browser
Director - Ron Howard[a]
Star - Alden Ehrenreich
-------------------------------------
Fetching info - Despicable_Me_3
https://en.wikipedia.org/wiki/Despicable_Me_3
Open web browser
Director - Pierre Coffin Kyle Balda
Star - Heitor PereiraPharrell
-------------------------------------
Fetching info - Jumanji:_Welcome_to_the_Jungle
https://en.wikipedia.org/wiki/Jumanji:_Welcome_to_the_Jungle
Open web browser
Director - Jake Kasdan
Star - Jumanjiby Chris
-------------------------------------
Fetching info - Bohemian_Rhapsody
https://en.wikipedia.org/wiki/Bohemian_Rhapsody
Open web browser
Director - Single by Queen
Star - 7-inch single
-------------------------------------
Fetching info - Spider-Man:_Homecoming
https://en.wikipedia.org/wiki/Spider-Man:_Homecoming
Open web browser
Director - Jon Watts
Star - Spider-Manby Stan
-------------------------------------
Fetching info - The_Secret_Life_of_Pets
https://en.wikipedia.org/wiki/The_Secret_Life_of_Pets
Open web browser
Director - Chris Renaud
Star - Alexandre Desplat
-------------------------------------
Fetching info - Wolf_Warrior_2
https://en.wikipedia.org/wiki/Wolf_Warrior_2
Open web browser
Director - nan
Star - War Wolf
-------------------------------------
Fetching info - Guardians_of_the_Galaxy_Vol._2
https://en.wikipedia.org/wiki/Guardians_of_the_Galaxy_Vol._2
Open web browser
Director - James Gunn
Star - Chris Pratt
-------------------------------------
Fetching info - Thor:_Ragnarok
https://en.wikipedia.org/wiki/Thor:_Ragnarok
Open web browser
Director - Taika Waititi
Star - Chris Hemsworth
-------------------------------------
Fetching info - Wonder_Woman_(2017_film)
https://en.wikipedia.org/wiki/Wonder_Woman_(2017_film)
Open web browser
Director - Patty Jenkins
Star - Wonder Womanby
-------------------------------------
Fetching info - Coco_(2017_film)
https://en.wikipedia.org/wiki/Coco_(2017_film)
Open web browser
Director - Lee Unkrich
Star - Anthony Gonzalez
-------------------------------------
Fetching info - Jumanji:_The_Next_Level
https://en.wikipedia.org/wiki/Jumanji:_The_Next_Level
Open web browser
Director - Jake Kasdan
Star - Dwayne Johnson
-------------------------------------
Fetching info - Pirates_of_the_Caribbean:_Dead_Men_Tell_No_Tales
https://en.wikipedia.org/wiki/Pirates_of_the_Caribbean:_Dead_Men_Tell_No_Tales
Open web browser
Director - Joachim Rønning Espen Sandberg
Star - Characters by
-------------------------------------
Fetching info - E.T._the_Extra-Terrestrial
https://en.wikipedia.org/wiki/E.T._the_Extra-Terrestrial
Open web browser
Director - Steven Spielberg
Star - John Williams
-------------------------------------
Fetching info - Deadpool_2
https://en.wikipedia.org/wiki/Deadpool_2
Open web browser
Director - David Leitch
Star - Ryan Reynolds
-------------------------------------

In [44]:
d = {'name_missing': missing_movies_list, 'director': temp_dir, 'star_missing': temp_star}

In [45]:
df = pd.DataFrame(d)
df.head()

                   name_missing                 director      star_missing
0             Avengers:_Endgame   Anthony RussoJoe Russo     Robert Downey
1  Star_Wars:_The_Force_Awakens             J. J. Abrams     Harrison Ford
2        Avengers:_Infinity_War   Anthony RussoJoe Russo     Robert Downey
3                     Frozen_II  Chris Buck Jennifer Lee      Kristen Bell
4          Black_Panther_(film)             Ryan Coogler  Chadwick Boseman

In [46]:
# Push the table to sql
df.to_sql(name='fetched_missing', con=engine, if_exists='append', index=False)

In [47]:
# Check if written successfully
pd.read_sql_query('select * from fetched_missing', con=engine).head()

                   name_missing                 director      star_missing
0             Avengers:_Endgame   Anthony RussoJoe Russo     Robert Downey
1  Star_Wars:_The_Force_Awakens             J. J. Abrams     Harrison Ford
2        Avengers:_Infinity_War   Anthony RussoJoe Russo     Robert Downey
3                     Frozen_II  Chris Buck Jennifer Lee      Kristen Bell
4          Black_Panther_(film)             Ryan Coogler  Chadwick Boseman